In [1]:
import pandas as pd
# ../ 폴더를 1칸 나옴. , ./ 현재폴더 , / root폴더
df = pd.read_excel('../z20_data/score.xlsx',index_col='지원번호')
df

       이름   학교  학년    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고   3  197   90   85  100  95  85      Python
2번    강태원  구로고   3  184   40   35   50  55  25        Java
3번    강호림  구로고   2  168   80   75   70  80  75  javascript
4번    김수찬  구로고   1  187   40   60   70  75  80         NaN
5번    김재욱  구로고   1  188   15   20   10  35  10         NaN
6번    박동현  단지고   3  202   80  100   95  85  80           C
7번    박혜정  단지고   2  188   55   65   45  40  35      PYTHON
8번    승근열  단지고   2  190  100   85   90  95  95          c#

In [5]:
# 컬럼의 최소 values값을 출력
df['영어'].min()
# 컬럼의 최소 values의 index값 출력
df['영어'].idxmin()

20

In [12]:
# 컬럼의 최대 values값을 출력
df['영어'].max()
# 컬럼의 최대 values의 index값을 출력
df['영어'].idxmax()
df.loc[df['영어'].idxmax()]

'6번'

In [22]:
# 1. 3학년 학생을 검색
df_3 = df[df['학년']==3]
# 2. 3학년중에 영어에서 최소값의 index를 리턴받아 검색
df_3.loc[df_3['영어'].idxmin()]

이름       강태원
학교       구로고
학년         3
키        184
국어        40
영어        35
수학        50
과학        55
사회        25
SW특기    Java
Name: 2번, dtype: object

In [24]:
df_3[df_3['영어'] == df_3['영어'].min()]
df_3[df_3['영어'] == 35]

       이름   학교  학년    키  국어  영어  수학  과학  사회  SW특기
지원번호
2번    강태원  구로고   3  184  40  35  50  55  25  Java

이름       강태원
학교       구로고
학년         3
키        184
국어        40
영어        35
수학        50
과학        55
사회        25
SW특기    Java
Name: 2번, dtype: object

'5번'

In [9]:
df.loc[df['영어'].idxmin()]

이름      김재욱
학교      구로고
학년        1
키       188
국어       15
영어       20
수학       10
과학       35
사회       10
SW특기    NaN
Name: 5번, dtype: object

In [8]:
df['영어']

지원번호
1번     85
2번     35
3번     75
4번     60
5번     20
6번    100
7번     65
8번     85
Name: 영어, dtype: int64